0/U
/*--------------------------------*- C++ -*----------------------------------*\
 =========                 |                                                 
 \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           
  \    /   O peration     | Version:  10                                    
   \  /    A nd           | Web:      www.OpenFOAM.org                      
    \/     M anipulation  |                                                 
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// ************************************************************************* //
dimensions [0 1 -1 0 0 0 0];
internalField   nonuniform List<vector>
45
(
    (0 0 0)
    (0.14231483827328514 0 0)
    (0.28173255684142967 0 0)
    (0.4154150130018864 0 0)
    (0.5406408174555976 0 0)
    (0.654860733945285 0 0)
    (0.7557495743542583 0 0)
    (0.8412535328311811 0 0)
...
);
boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    sides
    {
        type            empty;
    }
}
// ************************************************************************* //
