system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location	"system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

cell_count_x 45;
cell_count_y 1;

vertices
(
    (0 0 0) //0
    (1 0 0) //1
    (1 0.1 0)  //2
    (0 0.1 0)  //3
    (0 0 0.001)  //4
    (1 0 0.001)  //5
    (1 0.1 0.001)  //6
    (0 0.1 0.001)  //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($cell_count_x $cell_count_y 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (4 0 3 7)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    
    sides
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (3 2 6 7)
            (4 5 1 0)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
